Тест_ЗУП_31_КОРП/src/Enums/СостоянияСотрудника/СостоянияСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСотрудника</name>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>РаботаВОтпускеПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>Прогул</name>
  </enumValues>
  <enumValues>
    <name>ВынужденныйПрогул</name>
  </enumValues>
  <enumValues>
    <name>ПростойПоВинеРаботника</name>
  </enumValues>
  <enumValues>
    <name>ПростойПоВинеРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>ПростойНеЗависящийОтРаботодателяИРаботника</name>
  </enumValues>
  <enumValues>
    <name>ОтпускОсновной</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйОтпуск</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйОтпускНеоплачиваемый</name>
  </enumValues>
  <enumValues>
    <name>ОтпускУчебныйОплачиваемый</name>
  </enumValues>
  <enumValues>
    <name>ОтпускУчебныйНеоплачиваемый</name>
  </enumValues>
  <enumValues>
    <name>ОтпускНеоплачиваемыйПоРазрешениюРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>ОтпускНеоплачиваемыйПоЗаконодательству</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>Командировка</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствиеССохранениемОплаты</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеГосударственныхОбязанностей</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВыходныеДниОплачиваемые</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВыходныеДниНеОплачиваемые</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствиеПоНевыясненнымПричинам</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>ОтпускНаСанаторноКурортноеЛечение</name>
  </enumValues>
  <enumValues>
    <name>Болезнь</name>
  </enumValues>
  <enumValues>
    <name>БолезньБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>Факт</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/СостоянияСотрудника/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует массив состояний, которые не учитываются при вычислении стажа, дающего право на ежегодные оплачиваемые отпуска.
// См. ст. 121 ТК РФ.
//
// Возвращаемое значение:
//  Массив - содержит значения перечисления.
//
Функция СостоянияПрерывающиеПравоНаОтпуск() Экспорт 

	ПрерывающиеСостояния = Новый Массив;
	ПрерывающиеСостояния.Добавить(Перечисления.СостоянияСотрудника.Прогул);
	ПрерывающиеСостояния.Добавить(Перечисления.СостоянияСотрудника.ПростойПоВинеРаботника);
	ПрерывающиеСостояния.Добавить(Перечисления.СостоянияСотрудника.ОтсутствиеПоНевыясненнымПричинам);
	ПрерывающиеСостояния.Добавить(Перечисления.СостоянияСотрудника.ОтпускПоУходуЗаРебенком);
	ПрерывающиеСостояния.Добавить(Перечисления.СостоянияСотрудника.ОтпускНеоплачиваемыйПоЗаконодательству);
	ПрерывающиеСостояния.Добавить(Перечисления.СостоянияСотрудника.ДополнительныйОтпускНеоплачиваемый);
	ПрерывающиеСостояния.Добавить(Перечисления.СостоянияСотрудника.ОтпускУчебныйНеоплачиваемый);
	ПрерывающиеСостояния.Добавить(Перечисления.СостоянияСотрудника.ОтпускНеоплачиваемыйПоРазрешениюРаботодателя);

	Возврат ПрерывающиеСостояния;
	
КонецФункции
	
#КонецОбласти

#КонецЕсли
